{
  "id": "midnight_apothecary",
  "title": "THE MIDNIGHT APOTHECARY",
  "subtitle": "A Deadly Draught Claims a Prominent Physician",
  "teaser": "The esteemed Dr. Whitmore was found dead in his bed-chamber, victim of what appears to be his own sleeping draught—but the circumstances suggest a more sinister hand at work. His young assistant stands accused, yet the evidence is far from conclusive.",
  "briefing": "═══════════════════════════════════════════════════════════════════════════\n\n                    ❧ POISONING MOST FOUL ❧\n                        \nDr. JAMES WHITMORE, esteemed physician and pillar of the community, \nwas discovered lifeless in his study yesterday morning. The good \ndoctor had retired early, complaining of a headache, and requested \na sleeping draught from the local apothecary.\n\nBy dawn, he was dead. The constabulary have arrested Mr. THOMAS \nGREENE, the young apothecary's assistant who prepared the fatal \nmixture, charging him with murder by poison.\n\nYet whispers circulate through the district that all is not as it \nseems. Dr. Whitmore had enemies—patients who blamed him for failed \ntreatments, colleagues jealous of his reputation, and rumors of a \nscandal involving the doctor's young wife.\n\nWas this truly a case of negligent poisoning, or did someone \ndeliberately tamper with the doctor's medicine?\n\nThe truth awaits a discerning investigator.\n\n═══════════════════════════════════════════════════════════════════════════\n",
  "difficulty": 1,
  "estimatedMinutes": 30,
  "parVisits": 3,
  "locations": {
    "apothecary_shop": {
      "id": "apothecary_shop",
      "role": "suspectWork",
      "preferredTags": ["amenity=pharmacy", "shop=chemist"],
      "fallbackRole": "information",
      "required": true,
      "descriptionTemplate": "the apothecary shop where the fatal draught was prepared"
    },
    "doctor_residence": {
      "id": "doctor_residence",
      "role": "crimeScene",
      "preferredTags": ["building=residential", "building=house"],
      "fallbackRole": "witness",
      "required": true,
      "descriptionTemplate": "the late doctor's residence, now a scene of tragedy"
    },
    "local_tavern": {
      "id": "local_tavern",
      "role": "information",
      "preferredTags": ["amenity=pub", "amenity=bar"],
      "fallbackRole": "witness",
      "required": true,
      "descriptionTemplate": "a public house where gossip flows freely"
    },
    "hospital_ward": {
      "id": "hospital_ward",
      "role": "authority",
      "preferredTags": ["amenity=hospital", "amenity=clinic"],
      "fallbackRole": "information",
      "required": false,
      "descriptionTemplate": "the hospital where Dr. Whitmore once practiced"
    }
  },
  "characters": [
    {
      "id": "thomas_greene",
      "name": "Thomas Greene",
      "role": "Apothecary's Assistant",
      "locationId": "apothecary_shop",
      "description": "A nervous young man barely out of his apprenticeship, with ink-stained fingers and dark circles under his eyes. Thomas Greene speaks quickly, as if afraid he might not finish his sentence before being dragged away in irons.\n",
      "initialDialogue": "\"I swear upon my mother's grave, I followed the prescription exactly! Laudanum, fifteen drops. Valerian root. Nothing more!\"\n\nThomas wrings his hands, pacing behind the counter of the shop.\n\n\"The master, Mr. Pemberton, he trusts me with routine preparations. I've made hundreds of sleeping draughts without incident!\"\n\nHe pauses, lowering his voice.\n\n\"But there was something strange that night. Someone came in after closing, when I was cleaning up. I heard voices in the back—Mr. Pemberton speaking with someone. I didn't see who.\"\n\n\"The next morning, my prepared bottles had been moved. I thought nothing of it at the time...\"\n",
      "conditionalDialogue": {
        "clue_moved_bottles": "\"Yes! That's exactly what I mean! The bottles were in a different order than I left them!\"\n\nThomas becomes animated, hope flickering in his eyes.\n\n\"I always arrange them alphabetically—it's my system. But in the morning, the doctor's bottle was at the front, not where I placed it.\"\n\n\"Someone tampered with them. It wasn't me!\"\n",
        "clue_insurance": "\"Dr. Whitmore's wife? She came to the shop that very afternoon!\"\n\nThomas's eyes widen.\n\n\"She was asking about poisons—said she had a rat problem. Mr. Pemberton sold her arsenic. I remember because she paid in cash, which is unusual for the doctor's household.\"\n\n\"You don't think...?\"\n"
      }
    },
    {
      "id": "harold_pemberton",
      "name": "Harold Pemberton",
      "role": "Master Apothecary",
      "locationId": "apothecary_shop",
      "description": "A portly man with spectacles perched on a bulbous nose, Mr. Pemberton exudes an air of professional dignity somewhat undermined by the sweat beading on his forehead.\n",
      "initialDialogue": "\"A terrible business, terrible! Poor Thomas is a capable lad, but mistakes happen. The pressure of the work, you understand.\"\n\nMr. Pemberton adjusts his spectacles nervously.\n\n\"Dr. Whitmore was a valued customer. I prepared his medicines personally for years. But that night, I was... indisposed. I left Thomas to handle the closing.\"\n\n\"The boy must have confused the dosages. An honest error, but a fatal one.\"\n",
      "conditionalDialogue": {
        "clue_late_visitor": "Mr. Pemberton's composure cracks.\n\n\"A visitor? I... I don't recall any...\"\n\nHe mops his brow with a handkerchief.\n\n\"Very well. Yes, someone came after hours. A lady, heavily veiled. She had a private matter to discuss—feminine troubles, you understand. I am bound by professional discretion.\"\n\n\"It had nothing to do with Dr. Whitmore's medicine. Nothing at all!\"\n"
      }
    },
    {
      "id": "mary_whitmore",
      "name": "Mary Whitmore",
      "role": "The Widow",
      "locationId": "doctor_residence",
      "description": "A strikingly beautiful woman in her late twenties, far younger than her deceased husband. Mrs. Whitmore wears black crepe, but her eyes are dry and her demeanor is remarkably composed for a new widow.\n",
      "initialDialogue": "\"My husband was a great man. The community has lost a healer of exceptional skill.\"\n\nMrs. Whitmore sits rigidly in the parlor, hands folded in her lap.\n\n\"Our marriage was... conventional. He provided security. I provided companionship. We understood each other.\"\n\nShe glances toward the study door.\n\n\"James often worked late. His sleeping draughts were a necessity—his mind would not quiet without them. That the medicine meant to give him peace should be his end... it is cruelly ironic.\"\n",
      "conditionalDialogue": {
        "clue_insurance": "Mrs. Whitmore's composure finally wavers.\n\n\"The insurance policy? Yes, I am aware of it. James took it out years ago, when his practice was struggling.\"\n\nShe rises, moving to the window.\n\n\"You think me a monster. A young wife who married for money and murdered for inheritance. How... unoriginal.\"\n\n\"I did not kill my husband. But I know who did.\"\n\nShe turns, her eyes hard.\n\n\"Ask Mr. Pemberton about his debts. Ask him who forgave those debts in exchange for a small favor.\"\n"
      }
    },
    {
      "id": "samuel_doyle",
      "name": "Samuel Doyle",
      "role": "Publican",
      "locationId": "local_tavern",
      "description": "A barrel-chested man with arms like ham hocks, Samuel Doyle has run this establishment for twenty years and knows everyone's business whether they wish it or not.\n",
      "initialDialogue": "\"Dr. Whitmore? Aye, he'd come in of an evening. Brandy for the digestion, he'd say.\"\n\nThe publican polishes a glass with a rag of questionable cleanliness.\n\n\"Can't say I'm surprised someone did him in. Man had more enemies than friends, for all his fancy reputation.\"\n\n\"There was that business with Mrs. Collins—said his treatment killed her husband. And Dr. Hartley at the hospital fair hated him. Professional jealousy, they say.\"\n",
      "conditionalDialogue": {
        "clue_argument": "\"The argument? Oh, you heard about that?\"\n\nSamuel leans closer.\n\n\"Two nights before the poisoning, the apothecary—Pemberton—came in looking like death himself. He was muttering about debts, about being ruined.\"\n\n\"Then a well-dressed fellow joined him. Couldn't hear everything, but I caught 'make it look natural' and 'no one will suspect the assistant.'\"\n\n\"Pemberton left looking relieved. The other man paid for his drinks with a sovereign. Who carries sovereigns to a tavern?\"\n"
      }
    }
  ],
  "clues": [
    {
      "id": "clue_moved_bottles",
      "type": "testimony",
      "locationId": "apothecary_shop",
      "characterId": "thomas_greene",
      "title": "The Rearranged Medicines",
      "discoveryText": "════════════════════════════════════════════════════════════════════════════\n                        ❧ TESTIMONY RECORDED ❧\n════════════════════════════════════════════════════════════════════════════\n\nThomas Greene describes a disturbing observation:\n\n\"The bottles were moved. I always arrange them alphabetically, \nbut in the morning, Dr. Whitmore's sleeping draught was at the \nfront of the shelf, not in its proper place.\"\n\nThis suggests someone accessed the medicines after Thomas \nprepared them and before they were delivered.\n\n════════════════════════════════════════════════════════════════════════════\n",
      "notebookSummary": "Thomas noticed the medicine bottles had been rearranged overnight—someone accessed them after he finished preparing them.",
      "prerequisites": [],
      "reveals": ["local_tavern"],
      "isEssential": true,
      "isRedHerring": false
    },
    {
      "id": "clue_late_visitor",
      "type": "testimony",
      "locationId": "apothecary_shop",
      "characterId": "harold_pemberton",
      "title": "The Veiled Lady",
      "discoveryText": "════════════════════════════════════════════════════════════════════════════\n                        ❧ SUSPICIOUS VISITOR ❧\n════════════════════════════════════════════════════════════════════════════\n\nUnder pressure, Mr. Pemberton admits:\n\n\"Yes, a woman came after closing hours. She was heavily veiled \nand insisted on privacy. I... I cannot reveal her identity.\"\n\nHis nervous demeanor suggests there is more to this visit than \nhe is willing to admit. The timing is suspicious—the same night \nthe fatal draught was prepared.\n\n════════════════════════════════════════════════════════════════════════════\n",
      "notebookSummary": "A veiled woman visited the apothecary after hours on the night the poison was prepared. Pemberton refuses to identify her.",
      "prerequisites": ["clue_moved_bottles"],
      "reveals": [],
      "isEssential": true,
      "isRedHerring": false
    },
    {
      "id": "clue_argument",
      "type": "testimony",
      "locationId": "local_tavern",
      "characterId": "samuel_doyle",
      "title": "The Overheard Plot",
      "discoveryText": "════════════════════════════════════════════════════════════════════════════\n                        ❧ DAMNING EVIDENCE ❧\n════════════════════════════════════════════════════════════════════════════\n\nThe publican recounts a conversation he overheard:\n\n\"Pemberton was here two nights before the death, looking \nterrified. A well-dressed man joined him—couldn't see his \nface clearly.\"\n\n\"I heard them say 'make it look natural' and 'no one will \nsuspect the assistant.' Pemberton left looking relieved.\"\n\nThis strongly suggests Pemberton was recruited to tamper with \nthe medicine, using his assistant as a scapegoat.\n\n════════════════════════════════════════════════════════════════════════════\n",
      "notebookSummary": "The publican overheard Pemberton discussing a plot with an unknown man: 'make it look natural' and 'no one will suspect the assistant.' PEMBERTON WAS INVOLVED.",
      "prerequisites": ["clue_moved_bottles"],
      "reveals": ["doctor_residence"],
      "isEssential": true,
      "isRedHerring": false
    },
    {
      "id": "clue_insurance",
      "type": "record",
      "locationId": "doctor_residence",
      "title": "The Insurance Policy",
      "discoveryText": "════════════════════════════════════════════════════════════════════════════\n                        ❧ FINANCIAL MOTIVE ❧\n════════════════════════════════════════════════════════════════════════════\n\nAmong Dr. Whitmore's papers, you discover:\n\n    ╭─────────────────────────────────────────────────╮\n    │     METROPOLITAN LIFE ASSURANCE                 │\n    │                                                 │\n    │     INSURED: Dr. James Whitmore                 │\n    │     BENEFICIARY: Mary Whitmore (wife)           │\n    │     SUM ASSURED: £10,000                        │\n    │                                                 │\n    │     POLICY DATE: 3 months prior                 │\n    ╰─────────────────────────────────────────────────╯\n\nA substantial policy, taken out recently. Mrs. Whitmore stands \nto inherit a fortune from her husband's death.\n\n════════════════════════════════════════════════════════════════════════════\n",
      "notebookSummary": "Dr. Whitmore took out a £10,000 life insurance policy just three months ago. His wife is the sole beneficiary.",
      "prerequisites": [],
      "reveals": [],
      "isEssential": true,
      "isRedHerring": false
    },
    {
      "id": "clue_arsenic_purchase",
      "type": "record",
      "locationId": "apothecary_shop",
      "title": "The Arsenic Sale",
      "discoveryText": "════════════════════════════════════════════════════════════════════════════\n                        ❧ POISON REGISTER ❧\n════════════════════════════════════════════════════════════════════════════\n\nExamining the poison register (required by law for all toxic \nsubstance sales), you find an entry:\n\n    DATE: Two days before death\n    PURCHASER: Mrs. M. Whitmore\n    SUBSTANCE: Arsenic (white powder), 2 drams\n    PURPOSE STATED: Vermin control\n    PAYMENT: Cash\n\nThe handwriting is Pemberton's. Cash payment is unusual for a \nregular customer with an account.\n\n════════════════════════════════════════════════════════════════════════════\n",
      "notebookSummary": "Mrs. Whitmore purchased arsenic from the apothecary two days before her husband's death, paying cash instead of using the family account.",
      "prerequisites": [],
      "reveals": [],
      "isEssential": false,
      "isRedHerring": false
    }
  ],
  "solution": {
    "perpetratorId": "harold_pemberton",
    "motive": "DEBT AND COERCION\n\nHarold Pemberton, the master apothecary, was drowning in gambling \ndebts. He was approached by an unknown party (likely connected to \nMrs. Whitmore or another interested party) who offered to forgive \nhis debts in exchange for tampering with Dr. Whitmore's medicine.\n\nPemberton added poison to the sleeping draught after Thomas Greene \nprepared it, knowing the young assistant would be blamed for any \n\"error\" in the preparation.\n",
    "method": "After Thomas Greene prepared the standard sleeping draught, \nPemberton returned to the shop that night and added a lethal dose \nof arsenic to the mixture. He rearranged the bottles in his haste, \nwhich Thomas noticed the following morning.\n\nThe murder was meant to look like an accidental overdose by an \ninexperienced assistant, with Thomas taking the blame.\n",
    "keyEvidence": [
      "clue_argument",
      "clue_moved_bottles",
      "clue_late_visitor"
    ],
    "optimalPath": [
      "apothecary_shop",
      "local_tavern",
      "doctor_residence"
    ]
  }
}
